# GetSubelementOnLevel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..GetSubelementOnLevel Method
Railing Class See Also
---
Gets the subelement on given level.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Subelement GetSubelementOnLevel(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Function GetSubelementOnLevel ( _
	levelId As ElementId _
) As Subelement
```

Visual C++
---
```text
public:
Subelement^ GetSubelementOnLevel(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId The id of the level the railing subelement is placed on.
# ### Return Value
The subelement in given level. nullNothingnullptra null reference (Nothing in Visual Basic) will be returned if railing has no subelements on given level.
# Remarks
The method is valid only for railings hosted by stairs in MultistoryStairs. Input level should be a level of the railing stairs. See getStairsPlacementLevels method of MultistoryStairs.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The railing is not hosted by stairs in MultistoryStairs. |

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace